{
  "title": "Death and I",
  "preview": "I cradle death in my arms and I ask it not to consume me.",
  "detail": "I cradle death in my arms and I ask it not to consume me. Not to weigh me down into the ground; not to pursue me so strongly. My legs still ache to run and I have been promised a thousand tomorrows. My heart still craves to beat and it will defeat any sorrows. The earth is still so unknown, only familiar with just one coast, when I know there are lands I am meant to meet and see. I know there are mountaintops I am meant to greet, and oceans where I am to sink and swim deep. I know that there are woods calling for my footstep; for my exploration into the earth's lungs. I want to see it all, and I want to breathe. I want to remember that I am just as alive as everything around me.\n\nAnd how fortunate are we to be in such an ephemeral life. For all that this ground has changed and all the earth has been recreated, we are here now. We awaken every morn, we chase existence through the very same lens of our ancestors. The stars are still there to be observed; the gale still rushes to be heard. I lay on the grass and I feel the comfort of the dirt. I feel the stability of the earth, how in the sunshine the ground is warm and the grass pales and I am immersed. I can feel every rib that lies dormant in my chest; a heart that thumps and never rests. The wind folds around my body, silent and soothing as it embalms me. It reminds me that I am not done searching, and though I do not know what I'm looking for, I know it resides in the horizon. I know it lies in adventure and journey, in letting my eyes devour all that they can see. Deep inside me, I yearn to know our humanity. I want to see it in its depth, in its entirety. I want to be enlightened by every mind and every sight. I do not want to settle into a life that was not made by my design; that forces me to exist unfulfilled, with a million questions unanswered. For some absurd reason, I have faith that it will be okay. That I will, just this once, get my way, and the grass will brush against my ankles. The moon will be absent from its vigil, and every star will be visible. I will be immersed in that infinite mystery, and that will be all we need, death and I."
}
